#include "func.h"
/**
 * @brief Функция для нахождения разности между суммой квадратов и квадратом суммы первых n натуральных чисел
 * @param n Число n, для которого нужно найти разность
 * @return Разность между суммой квадратов и квадратом суммы первых n натуральных чисел
 */
int Task_6(int n);

/**
 * @brief Функция для нахождения n-го простого числа
 * @param n Порядковый номер простого числа, которое нужно найти
 * @return n-е простое число
 */
unsigned long long int Task_7(int n);

/**
 * @brief Функция для нахождения максимального произведения count_ соседних цифр в строке digits_
 * @param digits_ Строка, содержащая цифры
 * @param count_ Количество соседних цифр, произведение которых нужно найти
 * @return Максимальное произведение count_ соседних цифр в строке digits_
 */
long long int Task_8(char* digits_, int count_);

/**
 * @brief Функция для нахождения произведения тройки пифагоровых чисел, сумма которых равна sum_
 * @param sum_ Сумма тройки пифагоровых чисел
 * @return Произведение тройки пифагоровых чисел или -1, если такая тройка не найдена
 */
int Task_9(int sum_);

/**
 * @brief Функция для нахождения суммы всех простых чисел меньше limit
 * @param limit Верхняя граница диапазона для поиска простых чисел
 * @return Сумма всех простых чисел меньше limit
 */
long long int Task_10(int limit);